{
    "meta": {
        "version": "1.0.0"
    },
    "rules": [
        {
            "number": 1,
            "title": "upkeep",
            "texts": [
                {
                    "subtitle": "tax collection",
                    "order": "simultaneous",
                    "text": "All players must transfer a number of population tokens from stock to treasury equal to their tax rate for each of their cities on the map board. The default tax rate is 2, but this can be adjusted by Civilization Advances. Players cannot choose to refrain from collecting tax."
                },
                {
                    "subtitle": "tax revolts",
                    "order": "AST rank",
                    "text": "If 1 or more players do not have sufficient stock to collect their taxes, revolts occur. All other players finish tax collection. Then players with insufficient tokens in stock move all of their stock tokens to treasury. For each city that this player can not fully collect tax for, the beneficiary may choose and annex 1 of their cities. This beneficiary does not collect taxes this turn for any cities gained this way. If the beneficiary does not have sufficient cities a next beneficiary is selected. If all players have 9 cities, remaining cities are destroyed instead."
                },
                {
                    "subtitle": "population expansion",
                    "order": "AST rank",
                    "text": "Each player places population tokens from stock in each area containing tokens according to the following: 1 token in each area containing 1 of their tokens and 2 tokens in all areas containing 2 or more of their tokens."
                },
                {
                    "subtitle": "census",
                    "order": "AST rank",
                    "text": "After completing all expansion, all players count their tokens on the board and adjust their census markers accordingly. Cities and ships do not count as population."
                }
            ]
        },
        {
            "number": 2,
            "title": "movement and conflict",
            "texts": [
                {
                    "subtitle": "movement",
                    "order": "census (largest to smallest), AST rank",
                    "text": "Players may move each of their tokens on the board either 1 step to an area adjacent by land or onto a ship and may move each of their ships 4 steps. At any time during a players movemnet phase trun, that player may choose to construct ships. This can only be done in coastal areas containing 1 or more of his tokens. A player can have no more than 4 ships at any time. Constructing a ship costs 2 tokens which can be paid for by using treasury and/or by destroying tokens from the same area as the ship. Ships may be used the turn they are built. As soon as a player wants to use a ship that was built on a differenet turn, they must either pay 1 treasury token or destroy 1 of their tokens from anywhere on the board to maintain the ship. This must be done for each ship the player wished to use and can be done for ships the player does not wish to use this turn. Any ships not maintained are destroyed at the end of the players movement phase turn. Players may move each of their ships a maximum of 4 areas by water per turn. By default, ships cannot be moved through open sea areas. At any time during the ship's movement, the ship may embark or disambark any number of tokens, but the ship can not carry more than the carrying capacity. The default carrying capacity is 5. At the ships final destination, all tokens automatically disembark in that area. Tokens may move by land or by ship but not both. By default, ships do not engage in conflict or block the mmovement of other ships."
                },
                {
                    "subtitle": "token conflict resolution",
                    "order": "simultaneous",
                    "text": "Each round in a token conflict players take turns removing their tokens until the area is at or below population limit or all players involed have removed 1 token. The player with the least amount of tokens removes first. If players have equal number of tokens they must remove simultaneously."
                },
                {
                    "subtitle": "city conflict resolution",
                    "order": "AST rank",
                    "text": "a city attack is successful if the attacking player has at least 7 tokens in the area after resolving token conflicts. if the attack is successful, the attacking player may gain up to 3 treasury from stock and may choose to draw a trade card from the defending player's hand and the defending player replaces theuir city with 6 tokens from stock, or all of their tokens from stock if they have fewer than 6 tokens in stock. the defender may choose to wait for one other city attack to be resolved to possibly have more tokens in stock. regular token conflict now takes place."
                }
            ]          
        },
        {
            "number": 3,
            "title": "cities and support",
            "texts": [
                {
                    "subtitle": "city construction",
                    "order": "AST rank",
                    "text": "players may build as many cities per turn, not exceeding a total of 9 and meeting the following requirements: 6 tokens in an area containing a city cite, 12 tokens in an area without a city cite and with a initial population limit greater than 0 (\"wilderness ctiy\"). return all tokens in the area to stock and place a new city."
                },
                {
                    "subtitle": "surplus population removal",
                    "order": "AST rank",
                    "text": "remove all tokens exceeding the population limit from all areas. areas containing a city have a population limit of 0."
                },
                {
                    "subtitle": "city support check",
                    "order": "AST rank",
                    "text": "all players must have 2 tokens for each city they control. they must reduce cities, one at a time, until they meet city support requirements. cities constructed this turn must be reduced first."
                }
            ]            
        },
        {
            "number": 4,
            "title": "trade",
            "texts": [
                {
                    "subtitle": "primary trade card acquisition",
                    "order": "cities (fewest to most), AST rank",
                    "text": "each player draws 1 card per city they control, starting with stack number 1 and ending at the stack number equal to the number of cities they control. players cards are secretly held and players should not deisclose any inforamtion about their cards except when allowed during trading. if a stack is empty, players draw water for that stack instead."
                },
                {
                    "subtitle": "additional trade card acquisition",
                    "order": "cities (fewest to most), AST rank",
                    "text": "each player may purchase as many additional trade cards as they would like using treasury tokens. all players are able to purchase cards from stack number 9 for 15 tokens each. advancement cards make it possible to purchase cards from other stacks."
                },
                {
                    "subtitle": "trade",
                    "order": "simultaneous",
                    "text": "players may make as many trade deals as they would like (in the specified time limit) to build sets of cards and avoid calamities. A trade deal is the exchange of at least 3 trade cards per player between exactly 2 players. a trade offer consists of both players involved truthfully naming 2 trade cards and the total number of cards in the trade. the players may mention other trade cards but this information is not binding. the total number of trade cards exchanged need not be equall. once a deal is made, both players exchange the cards committed in the offer. only commodity and tradable calamity cards may be exchanged. players may not exchange tokens, advancement cards or other assets. conditional diplomatic and strategic moves as well as other trades may be mentioned but are not in any way binding as the result of a trade deal. all trade deals are final."
                }
            ]            
        },
        {
            "number": 5,
            "title": "calamities and special abilities",
            "texts": [
                {
                    "subtitle": "calamity selection",
                    "order": "simultaneous",
                    "text": "all players first discard any duplicate calamities and randomly discard from remaining calamities until they hold at most 3 calamities total, at most 2 of which are major. all players must reveal their total number of calamities before and after this phase. discarded calamities are shown face up."
                },
                {
                    "subtitle": "minor calamity resolution",
                    "order": "AST rank (highest to lowest)",
                    "text": "all players reveal any minor calamities held and resolve them in ascending stack number order."
                },
                {
                    "subtitle": "major calamity resolution",
                    "order": "calamity rank (smallest to largest), non-tradable before tradable",
                    "text": "all remaining calamities held by players are revealed and resolved in ascending stack order, non-tradable before tradable."
                },
                {
                    "subtitle": "special abilities",
                    "order": "AST position, AST rank",
                    "text": "players may choose to use any of their special abilities on advancement cards held."
                },
                {
                    "subtitle": "surplus population removal",
                    "order": "simultaneous",
                    "text": "each player removes any surplus population and then checks for city support following the same rules from the 'cities and support phase'."
                }
            ]            
        },
        {
            "number": 6,
            "title": "advancement cards",
            "texts": [
                {
                    "subtitle": "advancement card acquisition",
                    "order": "AST position, AST rank",
                    "text": "each player may choose to purchase any number of advancement cards using commodity card sets and treasury tokens."
                },
                {
                    "subtitle": "trade card hand limit",
                    "order": "simultaneous",
                    "text": "players must choose and discard trade cards until they hold at most 8 cards."
                }
            ]            
        },
        {
            "number": 7,
            "title": "cleenup",
            "texts": [
                {
                    "subtitle": "AST position alteration",
                    "order": "AST rank",
                    "text": "players move 1 space to the right on the AST chart if they meet the requirements of the new space."
                },
                {
                    "subtitle": "reshuffling trade cards",
                    "order": "simultaneous",
                    "text": "move the turn marker up one space. shuffle together all tradable and commodity cards of the same stack number that were returned this round and place them on the bottom of the appropriate stack. then place all non-tradable cards returned this round on the bottom of the appropriate stack."
                },
                {
                    "subtitle": "end of game",
                    "order": "simultaneous",
                    "text": "if any player's AST position is in the final space, 'late bronze age', the game ends this turn. the player with the highest score - 1 pt for each city, sum of all pts shown on advancement cards held and 5pts for each AST position. ties are broken by: i. AST position, ii. most advancement cards worth 6 pts, most advancement cards worth 3 pts, iii. the total non-discounted price of all advancement cards held, iv. highest value of credit tokens of a single color, v. highest total value of credits, vi. number of cities, vii. number of tokens on the board, viii. AST rank."
                }
            ]
        }
    ]
}
